LogMaster/wrk2/HtmlKituraClientWrk2V1.txt
Running 5m test @ http://169.254.185.136:8282/htmlKitura
  2 threads and 5 connections
  Thread calibration: mean lat.: 1.418ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.424ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms  639.66us   5.90ms   61.64%
    Req/Sec     2.55k   231.64     3.56k    68.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.39ms
 75.000%    1.91ms
 90.000%    2.30ms
 99.000%    2.90ms
 99.900%    3.45ms
 99.990%    4.08ms
 99.999%    5.17ms
100.000%    5.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.195     0.000000            1         1.00
       0.590     0.100000       140923         1.11
       0.789     0.200000       281353         1.25
       0.992     0.300000       421130         1.43
       1.192     0.400000       561582         1.67
       1.394     0.500000       702418         2.00
       1.494     0.550000       772270         2.22
       1.596     0.600000       842530         2.50
       1.697     0.650000       912750         2.86
       1.801     0.700000       982643         3.33
       1.914     0.750000      1053119         4.00
       1.972     0.775000      1088020         4.44
       2.032     0.800000      1123206         5.00
       2.093     0.825000      1158945         5.71
       2.155     0.850000      1193091         6.67
       2.223     0.875000      1228783         8.00
       2.259     0.887500      1246485         8.89
       2.295     0.900000      1263571        10.00
       2.333     0.912500      1281263        11.43
       2.373     0.925000      1298543        13.33
       2.419     0.937500      1316328        16.00
       2.445     0.943750      1325261        17.78
       2.473     0.950000      1333744        20.00
       2.507     0.956250      1342206        22.86
       2.549     0.962500      1350987        26.67
       2.601     0.968750      1359790        32.00
       2.631     0.971875      1364215        35.56
       2.663     0.975000      1368549        40.00
       2.699     0.978125      1372842        45.71
       2.743     0.981250      1377392        53.33
       2.789     0.984375      1381649        64.00
       2.815     0.985938      1383851        71.11
       2.845     0.987500      1386080        80.00
       2.877     0.989062      1388327        91.43
       2.913     0.990625      1390443       106.67
       2.955     0.992188      1392623       128.00
       2.979     0.992969      1393699       142.22
       3.007     0.993750      1394781       160.00
       3.039     0.994531      1395908       182.86
       3.077     0.995313      1396986       213.33
       3.125     0.996094      1398103       256.00
       3.151     0.996484      1398646       284.44
       3.179     0.996875      1399192       320.00
       3.209     0.997266      1399718       365.71
       3.245     0.997656      1400272       426.67
       3.287     0.998047      1400819       512.00
       3.311     0.998242      1401089       568.89
       3.339     0.998437      1401352       640.00
       3.371     0.998633      1401634       731.43
       3.407     0.998828      1401914       853.33
       3.451     0.999023      1402176      1024.00
       3.481     0.999121      1402311      1137.78
       3.509     0.999219      1402453      1280.00
       3.545     0.999316      1402584      1462.86
       3.585     0.999414      1402726      1706.67
       3.633     0.999512      1402863      2048.00
       3.661     0.999561      1402929      2275.56
       3.697     0.999609      1402997      2560.00
       3.735     0.999658      1403065      2925.71
       3.775     0.999707      1403133      3413.33
       3.825     0.999756      1403201      4096.00
       3.855     0.999780      1403235      4551.11
       3.881     0.999805      1403271      5120.00
       3.935     0.999829      1403305      5851.43
       3.973     0.999854      1403338      6826.67
       4.019     0.999878      1403372      8192.00
       4.045     0.999890      1403389      9102.22
       4.085     0.999902      1403407     10240.00
       4.131     0.999915      1403425     11702.86
       4.183     0.999927      1403442     13653.33
       4.247     0.999939      1403459     16384.00
       4.323     0.999945      1403467     18204.44
       4.359     0.999951      1403475     20480.00
       4.403     0.999957      1403484     23405.71
       4.459     0.999963      1403492     27306.67
       4.563     0.999969      1403501     32768.00
       4.643     0.999973      1403505     36408.89
       4.727     0.999976      1403509     40960.00
       4.783     0.999979      1403515     46811.43
       4.863     0.999982      1403518     54613.33
       4.983     0.999985      1403522     65536.00
       5.011     0.999986      1403524     72817.78
       5.067     0.999988      1403526     81920.00
       5.167     0.999989      1403529     93622.86
       5.235     0.999991      1403531    109226.67
       5.387     0.999992      1403533    131072.00
       5.399     0.999993      1403534    145635.56
       5.423     0.999994      1403535    163840.00
       5.559     0.999995      1403536    187245.71
       5.591     0.999995      1403537    218453.33
       5.627     0.999996      1403538    262144.00
       5.687     0.999997      1403539    291271.11
       5.687     0.999997      1403539    327680.00
       5.699     0.999997      1403540    374491.43
       5.699     0.999998      1403540    436906.67
       5.707     0.999998      1403541    524288.00
       5.707     0.999998      1403541    582542.22
       5.707     0.999998      1403541    655360.00
       5.799     0.999999      1403542    748982.86
       5.799     0.999999      1403542    873813.33
       5.799     0.999999      1403542   1048576.00
       5.799     0.999999      1403542   1165084.44
       5.799     0.999999      1403542   1310720.00
       5.899     0.999999      1403543   1497965.71
       5.899     1.000000      1403543          inf
#[Mean    =        1.426, StdDeviation   =        0.640]
#[Max     =        5.896, Total count    =      1403543]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1451978 requests in 5.00m, 2.12GB read
Requests/sec:   4839.94
Transfer/sec:      7.22MB

 >> |2017/09/06 23:06:34|HtmlKituraClientWrk2V1|Kitura HTML benchmarking
wrk2 -t2 -d5m -c5 --latency -R4840 --timeout 100s http://169.254.185.136:8282/htmlKitura