LogMaster/wrk2/PlaintextKituraClientWrk2V1.txt
Running 5m test @ http://169.254.185.136:8282/plaintextKitura
  2 threads and 5 connections
  Thread calibration: mean lat.: 1.431ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.425ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.43ms  648.97us  11.83ms   61.73%
    Req/Sec     2.58k   236.23     4.33k    68.04%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.40ms
 75.000%    1.92ms
 90.000%    2.30ms
 99.000%    2.91ms
 99.900%    3.47ms
 99.990%    5.23ms
 99.999%   10.64ms
100.000%   11.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.196     0.000000            1         1.00
       0.585     0.100000       141664         1.11
       0.782     0.200000       282934         1.25
       0.987     0.300000       424655         1.43
       1.191     0.400000       566229         1.67
       1.397     0.500000       707934         2.00
       1.500     0.550000       778565         2.22
       1.602     0.600000       849379         2.50
       1.706     0.650000       920091         2.86
       1.811     0.700000       990293         3.33
       1.925     0.750000      1061314         4.00
       1.983     0.775000      1096387         4.44
       2.043     0.800000      1132226         5.00
       2.101     0.825000      1167036         5.71
       2.163     0.850000      1202423         6.67
       2.231     0.875000      1238666         8.00
       2.265     0.887500      1256042         8.89
       2.301     0.900000      1273688        10.00
       2.339     0.912500      1291271        11.43
       2.381     0.925000      1309231        13.33
       2.427     0.937500      1326664        16.00
       2.453     0.943750      1335223        17.78
       2.485     0.950000      1344177        20.00
       2.521     0.956250      1352783        22.86
       2.565     0.962500      1361577        26.67
       2.619     0.968750      1370557        32.00
       2.649     0.971875      1374928        35.56
       2.685     0.975000      1379447        40.00
       2.721     0.978125      1383715        45.71
       2.761     0.981250      1388154        53.33
       2.807     0.984375      1392632        64.00
       2.833     0.985938      1394851        71.11
       2.859     0.987500      1396972        80.00
       2.891     0.989062      1399246        91.43
       2.927     0.990625      1401378       106.67
       2.971     0.992188      1403535       128.00
       2.997     0.992969      1404662       142.22
       3.027     0.993750      1405768       160.00
       3.061     0.994531      1406879       182.86
       3.099     0.995313      1407948       213.33
       3.143     0.996094      1409069       256.00
       3.169     0.996484      1409643       284.44
       3.193     0.996875      1410165       320.00
       3.225     0.997266      1410714       365.71
       3.261     0.997656      1411280       426.67
       3.301     0.998047      1411826       512.00
       3.325     0.998242      1412106       568.89
       3.351     0.998437      1412372       640.00
       3.385     0.998633      1412649       731.43
       3.427     0.998828      1412919       853.33
       3.479     0.999023      1413195      1024.00
       3.511     0.999121      1413330      1137.78
       3.545     0.999219      1413468      1280.00
       3.585     0.999316      1413610      1462.86
       3.641     0.999414      1413744      1706.67
       3.703     0.999512      1413883      2048.00
       3.737     0.999561      1413952      2275.56
       3.779     0.999609      1414020      2560.00
       3.833     0.999658      1414093      2925.71
       3.903     0.999707      1414158      3413.33
       4.005     0.999756      1414227      4096.00
       4.073     0.999780      1414262      4551.11
       4.151     0.999805      1414296      5120.00
       4.311     0.999829      1414332      5851.43
       4.559     0.999854      1414366      6826.67
       4.863     0.999878      1414400      8192.00
       5.051     0.999890      1414417      9102.22
       5.315     0.999902      1414434     10240.00
       5.535     0.999915      1414452     11702.86
       5.795     0.999927      1414469     13653.33
       6.251     0.999939      1414486     16384.00
       6.455     0.999945      1414495     18204.44
       6.643     0.999951      1414504     20480.00
       6.919     0.999957      1414512     23405.71
       7.651     0.999963      1414521     27306.67
       8.367     0.999969      1414529     32768.00
       8.871     0.999973      1414534     36408.89
       9.103     0.999976      1414538     40960.00
       9.335     0.999979      1414542     46811.43
       9.799     0.999982      1414547     54613.33
      10.023     0.999985      1414551     65536.00
      10.247     0.999986      1414553     72817.78
      10.423     0.999988      1414555     81920.00
      10.607     0.999989      1414557     93622.86
      10.791     0.999991      1414560    109226.67
      10.967     0.999992      1414562    131072.00
      10.999     0.999993      1414563    145635.56
      11.119     0.999994      1414564    163840.00
      11.191     0.999995      1414566    187245.71
      11.191     0.999995      1414566    218453.33
      11.311     0.999996      1414567    262144.00
      11.407     0.999997      1414568    291271.11
      11.407     0.999997      1414568    327680.00
      11.479     0.999997      1414569    374491.43
      11.479     0.999998      1414569    436906.67
      11.623     0.999998      1414570    524288.00
      11.623     0.999998      1414570    582542.22
      11.623     0.999998      1414570    655360.00
      11.831     0.999999      1414571    748982.86
      11.831     0.999999      1414571    873813.33
      11.831     0.999999      1414571   1048576.00
      11.831     0.999999      1414571   1165084.44
      11.831     0.999999      1414571   1310720.00
      11.839     0.999999      1414572   1497965.71
      11.839     1.000000      1414572          inf
#[Mean    =        1.429, StdDeviation   =        0.649]
#[Max     =       11.832, Total count    =      1414572]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1463380 requests in 5.00m, 0.99GB read
Requests/sec:   4877.93
Transfer/sec:      3.37MB

 >> |2017/09/06 23:39:35|PlaintextKituraClientWrk2V1|Kitura plaintext benchmarking
wrk2 -t2 -d5m -c5 --latency -R4878 --timeout 100s http://169.254.185.136:8282/plaintextKitura